[
    {
        "_questionID": "349782314",
        "_title": "contacts for applicants faced with admission issues",
        "_answer": "<p><ul>Admissions Office<li>Phone 1: 0303-937544</li><li>Phone 2: 0303-937542</li><li>Email: admissions@upsamail.edu.gh</li></ul><ul>School of Graduate Studies<li>Phone 1: 0303-937547</li><li>Phone 2: 024-4570264</li><li>Email: sogs@upsamail.edu.gh</li></ul><ul>Office of Doctoral Programmes<li>Phone 1: 026-2043555</li><li>Phone 2: 026-8222066</li><li>Email: odp@upsamail.edu.gh</li></ul>OR Visit the <a href='https://admissions.upsa.edu.gh/admissions/help-desk/'>Admission Help</a></p>",
        "_category": "admission",
        "_tags": "admission, application, enquiries, contacts, issues"
    },
    {
        "_questionID": "438986461",
        "_title": "available sessions at upsa",
        "_answer": "<p>Regular, Evening and Weekend Sessions are available for all undergraduate and diploma programmes except the LLB programme which is offered in the Regular Session only.</p>  <p>Moreover, the Regular Session is normally reserved for WASSCE/GBCE applicants.Mature and Top-up applicants to Level 200 and 300 are, therefore, encouraged to opt for Evening and Weekend Sessions.</p>",
        "_category": "admission",
        "_tags": "sessions, available sessions, morning, evening, regular, weekend"
    },
    {
        "_questionID": "209567859",
        "_title": "available programmes at upsa",
        "_answer": "<h4>Undergraduate Programmes</h4><ul><li>Bachelor of Laws (LLB)</li><li>Bachelor of Arts in Public Relations Management</li><li>Bachelor of Science in Accounting</li><li>Bachelor of Science in Accounting and Finance</li><li>Bachelor of Science in Business Economics</li><li>Bachelor of Science in Actuarial Science</li><li>Bachelor of Science in Banking and Finance</li><li>Bachelor of Business Administration</li><li>Bachelor of Science in Information Technology Management</li><li>Bachelor of Science in Marketing</li><li>Bachelor of Science in Real Estate Management and Finance</li><li>4-Year Bachelor of Laws (LLB)</li></ul><h4>Diploma  Programmes</h4><ul><li>Diploma in Accounting</li><li>Diploma in Marketing</li><li>Diploma in Management</li><li>Diploma in Public Relations</li><li>Diploma in Information Technology Management</li></ul>",
        "_category": "admission",
        "_tags": "courses, programmes, available programmes, courses studied,  courses offered"
    },
    {
        "_questionID": "172719663",
        "_title": "how to apply for admission in upsa",
        "_answer": "<h4>Purchase of Online Serial Numbers (OSN):</h4><p>Online Serial Numbers (OSN) for UPSA are available for purchase at the cost of GH¢200.00 for Ghanaian Applicants and US$120.00 for International Applicants at the following sales points:<ul><li>Any Ecobank or Access Bank branch nation-wide</li><li>Any Ghana Post (Post Office) branch nation-wide</li><li>By Visa/Master Card/Mobile Money using the link http://interpayafrica.com/custom/upsa</li><li>By mobile money (all networks) short code: *887*18#</li></ul></p><br><h4>Completion of Online Application Form</h4><p>All applications must be completed on-line i.e.<ul><li>Log on to admissions.upsa.edu.gh</li><li>Use the Online Serial Numbers (OSN) and the receipt number to access the on-line application form.</li><li>Fill in the application form and submit it online</li></ul></p><br><h4>Attachment of Supporting Documents</h4><p>All applicants are expected to scan and attach the following documents to their online application forms. All such documents to be attached must be scanned into PDF format.<ul><li>Certified copies of all certificates</li><li>Certified copies of original transcript(s) of academic records</li><li>Certificates confirmed by the professional body is required for professional applicants</li><li>Birth certificate or any national ID or legitimate documentary proof of date of birth</li></ul></p>",
        "_category": "admission",
        "_tags": "application form details, admission form details, admission requisites, admission process, applying for admission, apply, filling forms, filling application forms, admission forms, admission process"
    },
    {
        "_questionID": "447102487",
        "_title": "entry or admission requirements",
        "_answer": "<h4>General entry Requirements</h4><ul><li>West African Senior School Certificate Examination (WASSCE)</li><li>Senior Secondary School Certificate Examination (SSSCE)</li><li>General Business Certificate Examination (GBCE)</li><li>American High School Grade 12 with at least Final Grade Point of 3.0</li><li>General Certificate of Secondary Education (GCSE)/ Cambridge GCE ‘O’ and ‘A’ Level</li></ul><p>WASSCE and SSSCE/GBCE applicants must have at least credit passes (i.e. grade A1-C6 and grade A-D respectively) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to any three elective subjects.Note 1: Current final year SHS students, who will be writing WASSCE/GBCE in May/June 2021, are also eligible to apply. They will be required to indicate correctly their WASSCE/GBCE index numbers on the online application form.General Certificate of Secondary Education (GCSE)/ Cambridge GCE ‘O’ and ‘A’ Level applicants must have at least five (5) credit passes including English and Mathematics at the GCSE/Baccalaureate/Cambridge ‘O’ Level and three relevant subjects at the ‘A’ Level.</p><h4>Specific Entry Requirements</h4><li>Bachelor of Science in Real Estate Management and Finance applicants are required to have credit passes in Economics, Geography and any other elective subject.</li><li>Bachelor of Science in Actuarial Science applicants must have credit pass in Elective Mathematics.</li><li>Bachelor of Science in Business Economics applicants are required to have credit passes in Economics and Elective Mathematics.</li><li>Applicants for admission to the Bachelor of Laws programme will in addition to the above be required to pass both written examination and selection interview. The dates for the entrance examination and selection interview could be found on the menu for Admission</li><h5>University Diploma/Higher National Diploma(HND)/ Professional and others to Degree</h5><p><b>Level 200</b></p><p>General Requirements</p><p>Category A: WAEC General Certificate of Education (GCE) Advanced LevelPasses in any three (3) subjects (at least, one of the passes should be grade D or better) at the GCE Advanced Level plus a pass in General Paper. In addition, the applicant must have had credit passes (Grade 6) or better in five (5) subjects including English Language, Mathematics and any Science Subject at the GCE Ordinary (‘O’) Level.</p><p>Category B: Advanced Business Certificate Examinations (ABCE)Full diploma certificate (i.e. passes in five (5) subjects including three compulsory subjects in the diploma option of the ABCE) and at least two of the passes should be grade D or better. In addition, the applicant must have had credit passes in five (5) subjects including English Language, Mathematics and Integrated Science/Social Studies in the GBCE only.</p><p>Category C: Post-Secondary Teacher’s Certificate ‘A’/Diploma in EducationCertificate in a related disciplines awarded by any institution accredited by the National Accreditation Board (NAB).</p><p>Category D: Recognized Professional Qualifications:At least complete Level One (1) of any of the following recognized professional qualifications: ACCA (3 papers), CIB (5 papers), CIM (3 papers), CIMA (4 papers), ICAG (4 papers) and ICSA (4 papers) only. The professional qualification must be related to the programme being applied for.</p><p>Category E: Higher National Diploma (HND) with Second Class (Lower Division) awarded by NABPTEX in related disciplines (i.e. Accounting, Secretaryship & Management Studies, Purchasing & Supply, Marketing, Statistics, etc).</p><p>Category F: University/Tertiary Diploma in a related discipline with a Final Grade Point Average (FGPA) ranging from 1.00 to 2.49 awarded by any university accredited by NAB.</p><p><b>Specific/Additional Requirements</b></p><ul><li>Applicants who qualify under Categories C, D, E and F must, in addition, have WASSCE/SSSCE/GBCE passes of at least grade D7 or D respectively in three (3) core subjects and three (3) elective subjects or credit passes in five (5) subjects including English Language, Mathematics and any Science subject at the GCE ‘O’ Level.</li><li>Bachelor of Science in Actuarial Science programme must have credit pass in Elective Mathematics or Additional Mathematics.</li><li>Bachelor of Science in Real Estate Management and Finance applicants are required to have credit passes in Economics, Geography and any other elective subject.</li><li>Bachelor of Science in Business Economics applicants are required to have credit passess in Economics and Elective Mathematics.</li></ul><p><b>Note: Admission is not available for University Diploma/Higher National Diploma(HND)/ Professional applicants to Level 200 of the LLB programme.</b></p><p><b>Level 300</b></p><p>General Requirements</p><p>Category A: Higher National Diploma (HND) with at least Second Class (Upper Division) awarded by NABPTEX in related disciplines (e.g. Accounting, Secretaryship & Management Studies, Purchasing & Supply, Marketing, Statistics, etc).</p><p>Category B: University/Tertiary Diploma with at least FGPA of 2.5 (Credit) in related programmes (e.g. Accounting, Public Administration, Management and Marketing etc) from any university accredited by the NAB.</p><p>Category C:   Professional Qualification– applicants with at least a complete level two (2) of any of the following recognized professional qualifications related to the programme being applied for: ACCA (9 papers), CIB (10 papers), CIM (6 papers), CIMA (8 papers), ICAG (10 papers) and ICSA (8 papers) only.</p>  <p>Additional Requirements</p><p>Applicants who qualify under Categories A, B and C must, in addition, have WASSCE/SSSCE/GBCE passes of at least grade D7or D respectively in three (3) core subjects and three (3) elective subjects or credit passes in five (5) subjects including English Language, Mathematics and any Science subject at the GCE ‘O’ Level.</p><p><b>Note 3: Admission is not available for entry into Level 300 of the LLB, Bachelor of Science in Business Economics, Actuarial Science and Bachelor of Science in Real Estate Management and Finance programmes.</b></p>  <h5>Entry Requirements (Diploma)</h5><p>Category A</p><ul><li>WASSCE applicants must have passes (i.e. A1-D7) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to passes (i.e. A1-D7) in any three elective subjects. Note that at least three (3) of the core and elective subject should be credit passes (A1-C6). A credit pass is required for the relevant elective.</li><li>SSSCE/GBCE applicants must have at least credit passes (i.e. grade A-D) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to credit passes in any three elective subjects. A credit pass is required for the relevant elective.</li><li></li></ul><p>Category B</p><p>G.C.E. Advanced Level</p><p>Passes in any two (2) subjects at the GCE ‘A’ Level plus a pass in General Paper. In addition, the applicant must have had credit passes (at least Grade 6) in five (5) subjects including English Language, Mathematics and any Science Subject at the GCE ‘O’ Level.</p><h5>Entry Requirements (Mature Applicants)</h5><p>Mature Applicants applying for admission must satisfy the following entry requirements:</p><ul><li>Attained a minimum age of twenty-five (25) years by Wednesday, 30th June, 2021.</li><li>Show proof of age with birth certificate which is at least five (5) years old at the time of application.</li><li>Must have at least three (3) years’ work experience and should be able to provide a letter of appointment from their employer or show any proof of employment.</li><li>Must have at least three (3) years’ work experience and should be able to provide a letter of appointment from their employer or show any proof of employment.</li><li>Must possess at least WASSCE, SSSCE,GBCE, Teacher’s Cert ‘A’ and ‘O’Level</li><li>Must pass the University’s Mature Access Course Entrance Examinations which comprise Mathematics, English Language and Aptitude Test. A mature applicant shall be deemed to have passed the entrance examinations for consideration for admission if he/she obtains a pass mark of 40% in each paper.</li><li>Must pass a Selection Interview.</li></ul><p><b>Note:Mature Applicants for BSc. in Actuarial Science programme must have credit passes in Additional Mathematics or Elective Mathematics at the GCE ‘O’ Level/WASSCE/ SSSCE/GBCE.Mature Access Course Classes and Entrance Examinations<ul><li>Registration for the Mature Access Course Classes and Entrance Examinations begins immediately in the Admissions Office ( room 7 siedu mustapha building )</li><li>Mature Access Course Class</li><li>Mature Access Course Entrance held on specific  dates will take place </li><li>Successful mature applicants will be placed in Level 100.</li><li>Admission is not available for the Mature Applicants to the LLB programme.</li></ul><p>Further information on the Mature Access Course Classes and Entrance Examinations may be obtained from the Admissions Office on 0303 937542/44 or email: admissions@upsamail.edu.gh</p></b></p><h5>International Applicants</h5><p>International applicants may be admitted on the basis of qualifications from their home countries for which equivalence shall be determined by the National Accreditation Board of Ghana and submitted to the University. Evidence of proficiency in English Language will be required in the case of applicants from non-English speaking countries. International applicants are also requested to acquire Non-Citizen Ghana card as a prerequisite for offer of admission. International applicants who fail to provide evidence of having acquired this card will not have their applications processed.</p>",
        "_category": "admission",
        "_tags": "requirements, entry requirements, admission requirements"
    },
    {
        "_questionID": "604054631",
        "_title": "does upsa admit foreign students",
        "_answer": "<h3>Yes</h3>",
        "_category": "admission",
        "_tags": "foreign, foreign students, admission, students"
    },
    {
        "_questionID": "376980578",
        "_title": "purchase of upsa application or admission forms",
        "_answer": "<p>At the following sales points: Any Ecobank or Access Bank branch nation-wide</p>",
        "_category": "admission",
        "_tags": "sales of forms, admission forms, purchase, sales points, admission sales, buy"
    },
    {
        "_questionID": "538773103",
        "_title": "admission enquires or information",
        "_answer": "Visit the school admission <a href='https://admissions.upsa.edu.gh/'>site</a>",
        "_category": "admission",
        "_tags": "admission enquires, admission information, freshmen, students, post-admission, applicant admitted, application, admission list, student admitted"
    },
    {
        "_questionID": "281327441",
        "_title": "check admission or application status",
        "_answer": "<p>You will receive a message by text or email based on the  contact information provided when filling the form.</p>",
        "_category": "admission",
        "_tags": "application, status, pending admission, admission status"
    },
    {
        "_questionID": "620941697",
        "_title": "what is the cost of application or admission forms",
        "_answer": "<h3>Ghanaian Applicants</h3> <p>Online Serial Numbers (OSN) for upsa are available for purchase at the cost of GH¢200.00</p> <br> <h3>International students</h3> <p>Application forms cost USD120.00.</p>",
        "_category": "admission",
        "_tags": "cost of admission, cost of application, application forms, how much, admission fee, application fee, buy"
    },
    {
        "_questionID": "485950012",
        "_title": "what is the website address for the upsa admission portal",
        "_answer": "<p>Access the UPSA admission portal via <a href='https://upsasip.com/adm-area'>portal link</a></p>",
        "_category": "admission",
        "_tags": "admission portal, website address, web address"
    },
    {
        "_questionID": "590829501",
        "_title": "locate the law faculty block on upsa campus",
        "_answer": "<p>Located on the left hand side of the school entrance. It is Directly opposite the twin tower building.</p>",
        "_category": "campus-related",
        "_tags": "law faculty, law block, map, law students"
    },
    {
        "_questionID": "16419306",
        "_title": "locate lecture block on campus",
        "_answer": "<h4>Lecture Block Complex</h4> <p>This is a five story lecture hall complex accommodating lecture halls, a meeting room and offices spaces in the central spine on the ground floor. The remaining five floors have lecture halls at the wings and offices for the various departments in the central spine on each level. This facility has two main stair areas, a pedestrian ramp access on all floors and a lift at the main entry foyer. It can be found  closer to the Auditorium  and opposite the fountain.</p>",
        "_category": "campus-related",
        "_tags": "lecture hall, lecture block, LBC, map, classroom"
    },
    {
        "_questionID": "672896904",
        "_title": "locate library on campus",
        "_answer": "<p>The facility is a five story library complex .It comprises of open reading spaces, lending library, offices for staff of the library and professors, learning commons, research commons etc. It can be found right behind the Mustapha Siedu building.</p>",
        "_category": "campus-related",
        "_tags": "school library, Joshua Alabi Library, student library, library, map"
    },
    {
        "_questionID": "327230123",
        "_title": "locate istd",
        "_answer": "<p>ISTD (Information Services and Technology Directorate) Block This block houses the ISTD Directorate which is responsible for all IT related issues on the campus. It can be found on the ICT block which is opposite the law lecture halls.</p>",
        "_category": "campus-related",
        "_tags": "istd, information services and technology directorate, map"
    },
    {
        "_questionID": "480705889",
        "_title": "locate the administration block on campus",
        "_answer": "<p>This facility accommodates all the administrative offices of the University. It comprises of a central wing, north and south wing and a third east wing It also has a spacious car parking at the frontage. The building has a name Mustapha Siedu bodly written on it.</p>",
        "_category": "campus-related",
        "_tags": "administration, administration block, school administration, VC office, map"
    },
    {
        "_questionID": "229027939",
        "_title": "locate the upsa hospital",
        "_answer": "<p>The UPSA clinic provides hospital services for staff and students of the University community. It has currently an outpatient department (O.P.D), medical records section, male and female wards, doctors consulting room and treatment room. It is located opposite the basketball field and it’s right behind the ICT block.</p>",
        "_category": "campus-related",
        "_tags": "hospital, school clinic, health, map"
    },
    {
        "_questionID": "829149965",
        "_title": "locate the students sports facility",
        "_answer": "<p>The sports facility comprises of a football pitch, volleyball, basketball and lawn tennis court for use by students and is located in front of the Students Center</p>",
        "_category": "campus-related",
        "_tags": "football pitch, volley court, basketball court, tennis court, map"
    },
    {
        "_questionID": "146499831",
        "_title": "locate student center on campus",
        "_answer": "<p>The Student Centre can be found directly opposite the basketball field</p>",
        "_category": "campus-related",
        "_tags": "lecture hall, student centre, SRC Office, printing press, map"
    },
    {
        "_questionID": "629887245",
        "_title": "payment of fees",
        "_answer": "<p>Pay your academic facility user fees and miscellaneous charges or dues at the designated banks indicated on the fees schedule(Access Bank and EcoBank) <br> Follow the link below to disburse fees after payment at the bank is done: <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a>.<br>Use your student’s identification number as both username and password and change the password when logging-out.<br>Generate a print out for submission at the registration point.</p>",
        "_category": "fees-interpay related",
        "_tags": "school fees, fees, fee, student fees, bills"
    },
    {
        "_questionID": "528413885",
        "_title": "fees payment with mobile money or credit card",
        "_answer": "<p>Visit <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a>.<br> Click on the wallet tab. Choose top up by mobile or Credit/Debit Card.<br>Enter your Student Index Number and password to continue<br>Select mobile money option(You can choose to pay with Mobile money using MTN MoMo, Vodafone Cash and AirtelTigo Money)<br><ul><li>Enter your Mobile Number or Card details</li><li>Enter Amount</li><li>Submit to pay</li></ul><br>NB: either ways can be used by both freshers and student of UPSA.</p>",
        "_category": "fees-interpay related",
        "_tags": "top-up by mobile money, fees paying, mobile money, momo, credit card, top-up by credit card"
    },
    {
        "_questionID": "328887995",
        "_title": "disburse fees",
        "_answer": "<p>After logging to <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a>, select “Pay Fee” which is on the left side of the menu. <br>This will open the fee generated applicable to the student. You will then select the multiple fees you want to pay by clicking on 'select' button that is adjacent to the fee bills.<br>For the Facility Subsidy Fee, you have the option of paying in installments. <br>By default, you will fill the total amount owed. To pay in installements, You will have to key in the amount that you have to pay. Alternatively, you can use the drop down button to increase or reduce the amount. <br>The amounts against each bill will be accumulated at the top of the page, and the buttons selected by you will change their colors from white to black.<br>Once you have chosen all the fee amounts to pay, press 'Pay' to allow the system to pay the fee.<br> You will then be asked to confirm that you want to pay as shown below. If you press OK, the system will make the payment to the University's account. <br>You should understand that once you have confirmed a transaction, it cannot be reversed. As soon as you have confirmed the payment by clicking on the Pay button, you will receive a confirmation message. <br>Once you pay the fee, your current available balance in the bank will reduce and the fee line items will be removed from your bill.<br>NB: All Students are required to pay the appropriate Facility User Fees at Access Bank. Ensure that you quote correctly your  Student Identification Number  on all the pay-in-slips. Log on to <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a> to disburse the payment.</p>",
        "_category": "fees-interpay related",
        "_tags": "fees disbursement, interpay, disburse fees, school, fees, bills, fee, student"
    },
    {
        "_questionID": "647104671",
        "_title": "login into the upsa interpay",
        "_answer": "<p>To log in to the UPSA interpay system, you should enter your index number and password. If you cannot remember your password, click on Forgot Password to recover it.<br>To recover your password, you will be required to provide your username and email address so that a reset code will be sent to your email.</p>",
        "_category": "fees-interpay related",
        "_tags": "sign-in interpay, login interpay, interpay account, interpay"
    },
    {
        "_questionID": "766133402",
        "_title": "financial institutions accredited to receive fee payment",
        "_answer": "<p><ul>Continuing and new students are expected to pay their befitting Academic Facility Fees at the following banks:<li>Mainstream Students – Ecobank or Access Bank being based on the bank outlined in the student’s Admission letter.</li><li>Weekend School Students – Ecobank</li></ul></p>",
        "_category": "fees-interpay related",
        "_tags": "school fees, fees, fee, student fees, bills, accredited banks, fee payment, banks to pay fees at, pay fees at bank"
    },
    {
        "_questionID": "757028639",
        "_title": "apply for bed or book for a bed in upsa hostel as a student",
        "_answer": "<p><h4>Procedure for Application for Bed in the UPSA Hostel</h4><br> -Login to <a href='https://upsahostel.com'>UPSA Hostel</a><br> -Login with your INDEX NUMBER as username and DATE OF BIRTH as password for first login. You can change the password to your desired stronger password for security reasons. <br> -Edit your phone number and email address if they are not functional.<br> -Book a room of preference provided the room is in your hall of affiliation and then proceed to agree to the Terms and Conditions of the Tenancy Agreement.<br> -Proceed to make payment of the designated hostel facility user fee and related charges for the selected room, in any branch of Access Bank or Top-up by mobile money on <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a><br> -Proceed immediately to disburse the payment on <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a> using these steps: <ul> <li>Click on the Student Tab, then select Other Services. Click on Requests</li> <li>Select UPSA hostel facility fee</li> <li>Select Hall dues : Yaa Asantewaa/Opoku Ampomah/Liberty or Mandela (select which hall is applicable)</li> <li>Select UPSA hostel refundable deposit for damages</li> <li>UPSA hostel initial electricity credit</li> <li>Click on the Calculate Bill button</li> <li>Click on the Pay Bill button</li> </ul><br>             NB: Please take note that failure to make payment and disbursement within specific period of time, will lead to cancellation of bookings. A confirmation SMS shall be sent to applicant after successful payment and disbursement within the 24-hour mandatory period.<br> Login with your credentials to view booking information and print out your Tenancy Agreement.</p>",
        "_category": "hostel related",
        "_tags": "hostel booking, school hostel, student accommodation, hostel fees payment, hostel fees disbursement"
    },
    {
        "_questionID": "592141783",
        "_title": "hostel registration",
        "_answer": "<p>All UPSA students who successfully secure bed through the application exercise shall be required to do registration at the Porter’s Lodge before starting residence.<br>Timetable for the registration exercise is always published or communicated in due course.<br>Note that you will be required to atleast provide two passport size pictures of yourself  with your index number and room number written behind them.<br>NB: The use of improper passport picture shall lead to the withdrawal of the assigned room. Where it is discovered that no passport picture is uploaded, the assigned room shall be withdrawn.</p>",
        "_category": "hostel related",
        "_tags": "hostel lodging, sign in at porter lodge, access to hostel room"
    },
    {
        "_questionID": "125442877",
        "_title": "beds availability",
        "_answer": "<p>There is a four (4) in a room occupancy  and a two (2) in a room occupancy. Both room occupancy comes with a different fee, fees will be communicated accross respectively while paying on <a href='https://www.interpayafrica.com/upsa/student'>UPSA Interpay</a>.</p>",
        "_category": "hostel related",
        "_tags": "available beds, beds, hostel beds, book beds, hostel booking"
    },
    {
        "_questionID": "117128466",
        "_title": "check results",
        "_answer": "<p>Go to UPSA student portal, Sign in by entering your student login details in the appropriate fields provided.<br>Navigate to the result section and select the semester you need to access your result.</p>",
        "_category": "school-related",
        "_tags": "semester results, results, student results, terminal, term, report"
    },
    {
        "_questionID": "722048651",
        "_title": "register courses",
        "_answer": "<p>After Payment and disbursement of fees proceed to register courses by using the UPSA Course Registration Portal. Access the student on-line registration portal by logging on to http://upsasip.com. <br>Print out two (2) copies of Proof of Registration Slip upon successful completion of the on-line registration.</p>",
        "_category": "school-related",
        "_tags": "semester course, course registration, register, courses, student registration"
    },
    {
        "_questionID": "889356440",
        "_title": "register re-sit papers",
        "_answer": "<p>Once done with the course registration, you could now pay and disburse for your re-sit registration provided you have any first semester paper(s) you wish to resit. <br> Each Credit Hour of a re-sit paper (course) registered attracts a fee of GH¢20.00) e.g. BCPC212: Business Ethics is a 3 credit hour paper and therefore attracts a re-sit registration fee of Sixty Ghana cedis (GH¢60.00). <br>Return to your USIS Student’s portal to do your resit registration and generate the proof of registration.</p>",
        "_category": "school-related",
        "_tags": "resit, re-sit, re-sit exams, re-sit papers, student re-sit"
    },
    {
        "_questionID": "147291848",
        "_title": "submission and endorsement of proof of registration slips",
        "_answer": "<p>Submit the Proof of Registration Slips to your Department Officer for endorsement after which one (1) copy of the slip will be given back to you. Weekend Students are, nonetheless, requested to carry out the same process at the Weekend School Secretariat.</p>",
        "_category": "school-related",
        "_tags": "proof of registration, course registration, signing proof of registration, student registration"
    },
    {
        "_questionID": "474230524",
        "_title": "register for graduation congregation",
        "_answer": "<p>Registration for the Congregation: <br> Graduands who have successfully completed their programmes of study during their specific academic year in their afore mentioned Faculties and Schools and wish to be presented during the graduation Congregation are required to be cleared of all financial obligations to the University prior to registration for the Congregation. <br> A non-refundable fee of GH¢330.00 is required to be paid at any branch of Access Bank Ltd. After payment of the fee, graduands must log onto https://www.interpayafrica.com/upsa/student to disburse the payment.  After having paid and disbursed the graduation fee, graduands who wish to participate in the Congregation should log into their USIS student portal and click on the “Register for Graduation” tab to register for the graduation ceremony. Graduands registered for the Congregation are expected to be seated by 8 a.m. on the date of their Congregation Ceremony. <br> Note: Only graduands who have paid their graduation fee and have been cleared of all financial obligations will be issued with graduation gowns, souvenirs, a free copy of their transcript, and have their certificates released to them.</p>",
        "_category": "school-related",
        "_tags": "graduation, congregation, graduation registration, final year"
    },
    {
        "_questionID": "73448321",
        "_title": "activate your upsa mail",
        "_answer": "<h4>How to Activate your UPSA Mail</h4><p>If you are using a personal smartphone or tablet: Go to the settings of the device (whether Android or iOS) and select the option to add Accounts and choose Gmail. <br>If you are using a laptop or PC: Open a browser and log on to www.gmail.com. Click on ‘Sign in’ button. Use your IDnumber@upsamail.edu.gh as your email address and click on the ‘next’ button.<br>Example: 10280238@upsamail.edu.gh. Enter the default password UPSA2013 and click on the ‘Next’ button. <br>Click on the ‘Accept’ button to accept the Google Terms of Service and the Google Privacy Policy. <br>If you activated your account using Smart Phone or Tablet (either on Android or iOS) your UPSAmail account should be listed as one of the Gmail accounts on your device. It is important to change your password after UPSAmail Activation to ensure the total security of your UPSAmail and other Google Apps (such as Google Drive, Doc, Sheet, Slides, Calendar, Form, Meet, etc.,) that you are entitled to use freely as part of the Apps associated with your UPSAmail. <br>In case you forget or lose your password, you can use your phone number to receive an SMS code on your phone to reset your password. This is only possible if you have done settings for Mobile Phone Password Recovery.</p>",
        "_category": "school-related",
        "_tags": "student email, school email, email, activate mail, mail"
    },
    {
        "_questionID": "783769713",
        "_title": "connect to virtual classroom",
        "_answer": "<p>The web address (URL) to UPSA-Virtual is <a href='https://join.upsavirtual.site>join.upsavirtual.site</a>. However, accessing UPSA-Virtual for the first time requires that you activate your UPSA-Virtual account by accessing a link from your UPSAmail.</p>",
        "_category": "virtual-class",
        "_tags": "learning management system, virtual classroom, upsa virtual, online class, lms"
    },
    {
        "_questionID": "626863649",
        "_title": "activate your upsa virtual account (first-time login)",
        "_answer": "<p>Open your UPSA mail. You will find a link to UPSA-Virtual in your mail. Click on the link and follow the instruction in your mail to access UPSA-Virtual Follow the instructions to change your password. (It will be your new password for subsequent logins).</p>",
        "_category": "virtual-class",
        "_tags": "virtual site activation, activate upsa virtual, login to upsa virtual, login into lms, lms, learning management system"
    },
    {
        "_questionID": "787679624",
        "_title": "log in to upsa virtual (after activation or after first-time login)",
        "_answer": "<p><ul><li>Visit <a href='join.upsavirtual.site'>UPSA Virtual Site</a></li><li>Enter your index number (e.g. 10090428) in username textbox</li><li>Enter your current password</li><li>Click on ‘Log in’ button to log in</li></ul></p>",
        "_category": "virtual-class",
        "_tags": "virtual site activation, activate upsa virtual, login to upsa virtual, login into lms, lms, learning management system"
    },
    {
        "_questionID": "352551700",
        "_title": "reset your password for upsa virtual account",
        "_answer": "<p><ul><li>Visit <a href='join.upsavirtual.site'>UPSA Virtual Site</a> and click on the ‘Forgotten username or password’ link.</li><li>Enter only your index number in the username textbox.If you entered your index number correctly, an email with a link to reset your password will be sent to your UPSAmail by the notification.</li><li>Log in to your UPSAmail. Access the mail with the subject “UPSA E-Learning Platform: Password reset request”. </li><li>Follow the instructions in the mail to reset your password.</li></ul></p>",
        "_category": "virtual-class",
        "_tags": "password reset, upsa virtual account, reset, password, lms"
    },
    {
        "_questionID": "252251782",
        "_title": "locate the administration block on campus",
        "_answer": "<p>This facility accommodates all the administrative offices of the University. It comprises of a central wing, north and south wing and a third east wing It also has a spacious car parking at the frontage. The building has a name Mustapha Siedu bodly written on it.</p>",
        "_category": "virtual-class",
        "_tags": "administration, administration block, school administration, VC office, map"
    },
    {
        "_questionID": "293325116",
        "_title": "submit your assignment on the lms",
        "_answer": "<p>First, click on the course whose assignment you want to submit and locate the week of the assignment <br> Then click on the assignment after locating the submission status of the assignment. <br> Below the submission status, locate add submission and click on it. <br>A text box is displayed with icons on top. Click on the copy icon. Other icons are displayed under the file manager then click on the first icon. <br> Locate the upload a file link and click on choose file under attachment to select your typed solution to the assignment. <br> Name the file using the save as box and click on upload this file located below.<br>The site takes you back to submission status. Make sure the submission status is submitted for grading. <br>You are done with your submission but you can check your student email for the confirmation. <br> Most lecturers communicate with class reps. To convey information , therefore for any other information or assistance contact your course reps or lead lectures.</p>",
        "_category": "virtual-class",
        "_tags": "virtual platform, virtual site, upsa virtual, assignment submission, lms, learning management system"
    }
]