[
  {
      "title": "contacts for applicants faced with admission issues",
      "category": "admission",
      "answer": "<p>\t<ul>Admissions Office<li>Phone 1: 0303-937544</li><li>Phone 2: 0303-937542</li><li>Email: admissions@upsamail.edu.gh</li></ul><ul>School of Graduate Studies<li>Phone 1: 0303-937547</li><li>Phone 2: 024-4570264</li><li>Email: sogs@upsamail.edu.gh</li></ul><ul>Office of Doctoral Programmes<li>Phone 1: 026-2043555</li><li>Phone 2: 026-8222066</li><li>Email: odp@upsamail.edu.gh</li></ul>OR Visit the <a href='https://admissions.upsa.edu.gh/admissions/help-desk/'>Admission Help</a></p>",
      "tags": "admission, application, enquiries, contacts, issues"
  },
  {
      "title": "available sessions at upsa",
      "category": "admission",
      "answer": "<p>Regular, Evening and Weekend Sessions are available for all undergraduate and diploma programmes except the LLB programme which is offered in the Regular Session only.</p>  <p>Moreover, the Regular Session is normally reserved for WASSCE/GBCE applicants.Mature and Top-up applicants to Level 200 and 300 are, therefore, encouraged to opt for Evening and Weekend Sessions.</p>",
      "tags": "sessions, available sessions, morning, evening, regular, weekend"
  },
  {
      "title": "available programmes at upsa",
      "category": "admission",
      "answer": "<h4>Undergraduate Programmes</h4><ul><li>Bachelor of Laws (LLB)</li><li>Bachelor of Arts in Public Relations Management</li><li>Bachelor of Science in Accounting</li><li>Bachelor of Science in Accounting and Finance</li><li>Bachelor of Science in Business Economics</li><li>Bachelor of Science in Actuarial Science</li><li>Bachelor of Science in Banking and Finance</li><li>Bachelor of Business Administration</li><li>Bachelor of Science in Information Technology Management</li><li>Bachelor of Science in Marketing</li><li>Bachelor of Science in Real Estate Management and Finance</li><li>4-Year Bachelor of Laws (LLB)</li></ul><h4>Diploma  Programmes</h4><ul><li>Diploma in Accounting</li><li>Diploma in Marketing</li><li>Diploma in Management</li><li>Diploma in Public Relations</li><li>Diploma in Information Technology Management</li></ul>",
      "tags": "courses, programmes, available programmes, courses studied,  courses offered"
  },
  {
      "title": "how to apply for admission in upsa",
      "category": "admission",
      "answer": "<h4>Purchase of Online Serial Numbers (OSN):</h4><p>Online Serial Numbers (OSN) for UPSA are available for purchase at the cost of GH¢200.00 for Ghanaian Applicants and US$120.00 for International Applicants at the following sales points:<ul><li>Any Ecobank or Access Bank branch nation-wide</li><li>Any Ghana Post (Post Office) branch nation-wide</li><li>By Visa/Master Card/Mobile Money using the link http://interpayafrica.com/custom/upsa</li><li>By mobile money (all networks) short code: *887*18#</li></ul></p><br><h4>Completion of Online Application Form</h4><p>All applications must be completed on-line i.e.<ul><li>Log on to admissions.upsa.edu.gh</li><li>Use the Online Serial Numbers (OSN) and the receipt number to access the on-line application form.</li><li>Fill in the application form and submit it online</li></ul></p><br><h4>Attachment of Supporting Documents</h4><p>All applicants are expected to scan and attach the following documents to their online application forms. All such documents to be attached must be scanned into PDF format.<ul><li>Certified copies of all certificates</li><li>Certified copies of original transcript(s) of academic records</li><li>Certificates confirmed by the professional body is required for professional applicants</li><li>Birth certificate or any national ID or legitimate documentary proof of date of birth</li></ul></p>",
      "tags": "application form details, admission form details, admission requisites, admission process, applying for admission, apply, filling forms, filling application forms, admission forms, admission process"
  },
  {
      "title": "entry or admission requirements",
      "category": "admission",
      "answer": "<h4>General entry Requirements</h4><ul><li>West African Senior School Certificate Examination (WASSCE)</li><li>Senior Secondary School Certificate Examination (SSSCE)</li><li>General Business Certificate Examination (GBCE)</li><li>American High School Grade 12 with at least Final Grade Point of 3.0</li><li>General Certificate of Secondary Education (GCSE)/ Cambridge GCE ‘O’ and ‘A’ Level</li></ul><p>WASSCE and SSSCE/GBCE applicants must have at least credit passes (i.e. grade A1-C6 and grade A-D respectively) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to any three elective subjects.Note 1: Current final year SHS students, who will be writing WASSCE/GBCE in May/June 2021, are also eligible to apply. They will be required to indicate correctly their WASSCE/GBCE index numbers on the online application form.General Certificate of Secondary Education (GCSE)/ Cambridge GCE ‘O’ and ‘A’ Level applicants must have at least five (5) credit passes including English and Mathematics at the GCSE/Baccalaureate/Cambridge ‘O’ Level and three relevant subjects at the ‘A’ Level.</p><h4>Specific Entry Requirements</h4><li>Bachelor of Science in Real Estate Management and Finance applicants are required to have credit passes in Economics, Geography and any other elective subject.</li><li>Bachelor of Science in Actuarial Science applicants must have credit pass in Elective Mathematics.</li><li>Bachelor of Science in Business Economics applicants are required to have credit passes in Economics and Elective Mathematics.</li><li>Applicants for admission to the Bachelor of Laws programme will in addition to the above be required to pass both written examination and selection interview. The dates for the entrance examination and selection interview could be found on the menu for Admission</li><h5>University Diploma/Higher National Diploma(HND)/ Professional and others to Degree</h5><p><b>Level 200</b></p><p>General Requirements</p><p>Category A: WAEC General Certificate of Education (GCE) Advanced LevelPasses in any three (3) subjects (at least, one of the passes should be grade D or better) at the GCE Advanced Level plus a pass in General Paper. In addition, the applicant must have had credit passes (Grade 6) or better in five (5) subjects including English Language, Mathematics and any Science Subject at the GCE Ordinary (‘O’) Level.</p><p>Category B: Advanced Business Certificate Examinations (ABCE)Full diploma certificate (i.e. passes in five (5) subjects including three compulsory subjects in the diploma option of the ABCE) and at least two of the passes should be grade D or better. In addition, the applicant must have had credit passes in five (5) subjects including English Language, Mathematics and Integrated Science/Social Studies in the GBCE only.</p><p>Category C: Post-Secondary Teacher’s Certificate ‘A’/Diploma in EducationCertificate in a related disciplines awarded by any institution accredited by the National Accreditation Board (NAB).</p><p>Category D: Recognized Professional Qualifications:At least complete Level One (1) of any of the following recognized professional qualifications: ACCA (3 papers), CIB (5 papers), CIM (3 papers), CIMA (4 papers), ICAG (4 papers) and ICSA (4 papers) only. The professional qualification must be related to the programme being applied for.</p><p>Category E: Higher National Diploma (HND) with Second Class (Lower Division) awarded by NABPTEX in related disciplines (i.e. Accounting, Secretaryship & Management Studies, Purchasing & Supply, Marketing, Statistics, etc).</p><p>Category F: University/Tertiary Diploma in a related discipline with a Final Grade Point Average (FGPA) ranging from 1.00 to 2.49 awarded by any university accredited by NAB.</p><p><b>Specific/Additional Requirements</b></p><ul><li>Applicants who qualify under Categories C, D, E and F must, in addition, have WASSCE/SSSCE/GBCE passes of at least grade D7 or D respectively in three (3) core subjects and three (3) elective subjects or credit passes in five (5) subjects including English Language, Mathematics and any Science subject at the GCE ‘O’ Level.</li><li>Bachelor of Science in Actuarial Science programme must have credit pass in Elective Mathematics or Additional Mathematics.</li><li>Bachelor of Science in Real Estate Management and Finance applicants are required to have credit passes in Economics, Geography and any other elective subject.</li><li>Bachelor of Science in Business Economics applicants are required to have credit passess in Economics and Elective Mathematics.</li></ul><p><b>Note: Admission is not available for University Diploma/Higher National Diploma(HND)/ Professional applicants to Level 200 of the LLB programme.</b></p><p><b>Level 300</b></p><p>General Requirements</p><p>Category A: Higher National Diploma (HND) with at least Second Class (Upper Division) awarded by NABPTEX in related disciplines (e.g. Accounting, Secretaryship & Management Studies, Purchasing & Supply, Marketing, Statistics, etc).</p><p>Category B: University/Tertiary Diploma with at least FGPA of 2.5 (Credit) in related programmes (e.g. Accounting, Public Administration, Management and Marketing etc) from any university accredited by the NAB.</p><p>Category C:   Professional Qualification– applicants with at least a complete level two (2) of any of the following recognized professional qualifications related to the programme being applied for: ACCA (9 papers), CIB (10 papers), CIM (6 papers), CIMA (8 papers), ICAG (10 papers) and ICSA (8 papers) only.</p>  <p>Additional Requirements</p><p>Applicants who qualify under Categories A, B and C must, in addition, have WASSCE/SSSCE/GBCE passes of at least grade D7or D respectively in three (3) core subjects and three (3) elective subjects or credit passes in five (5) subjects including English Language, Mathematics and any Science subject at the GCE ‘O’ Level.</p><p><b>Note 3: Admission is not available for entry into Level 300 of the LLB, Bachelor of Science in Business Economics, Actuarial Science and Bachelor of Science in Real Estate Management and Finance programmes.</b></p>  <h5>Entry Requirements (Diploma)</h5><p>Category A</p><ul><li>WASSCE applicants must have passes (i.e. A1-D7) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to passes (i.e. A1-D7) in any three elective subjects. Note that at least three (3) of the core and elective subject should be credit passes (A1-C6). A credit pass is required for the relevant elective.</li><li>SSSCE/GBCE applicants must have at least credit passes (i.e. grade A-D) in three core subjects including English Language, Mathematics and Integrated Science/Social Studies in addition to credit passes in any three elective subjects. A credit pass is required for the relevant elective.</li><li></li></ul><p>Category B</p><p>G.C.E. Advanced Level</p><p>Passes in any two (2) subjects at the GCE ‘A’ Level plus a pass in General Paper. In addition, the applicant must have had credit passes (at least Grade 6) in five (5) subjects including English Language, Mathematics and any Science Subject at the GCE ‘O’ Level.</p><h5>Entry Requirements (Mature Applicants)</h5><p>Mature Applicants applying for admission must satisfy the following entry requirements:</p><ul><li>Attained a minimum age of twenty-five (25) years by Wednesday, 30th June, 2021.</li><li>Show proof of age with birth certificate which is at least five (5) years old at the time of application.</li><li>Must have at least three (3) years’ work experience and should be able to provide a letter of appointment from their employer or show any proof of employment.</li><li>Must have at least three (3) years’ work experience and should be able to provide a letter of appointment from their employer or show any proof of employment.</li><li>Must possess at least WASSCE, SSSCE,GBCE, Teacher’s Cert ‘A’ and ‘O’Level</li><li>Must pass the University’s Mature Access Course Entrance Examinations which comprise Mathematics, English Language and Aptitude Test. A mature applicant shall be deemed to have passed the entrance examinations for consideration for admission if he/she obtains a pass mark of 40% in each paper.</li><li>Must pass a Selection Interview.</li></ul><p><b>Note:Mature Applicants for BSc. in Actuarial Science programme must have credit passes in Additional Mathematics or Elective Mathematics at the GCE ‘O’ Level/WASSCE/ SSSCE/GBCE.Mature Access Course Classes and Entrance Examinations<ul><li>Registration for the Mature Access Course Classes and Entrance Examinations begins immediately in the Admissions Office ( room 7 siedu mustapha building )</li><li>Mature Access Course Class</li><li>Mature Access Course Entrance held on specific  dates will take place </li><li>Successful mature applicants will be placed in Level 100.</li><li>Admission is not available for the Mature Applicants to the LLB programme.</li></ul><p>Further information on the Mature Access Course Classes and Entrance Examinations may be obtained from the Admissions Office on 0303 937542/44 or email: admissions@upsamail.edu.gh</p></b></p><h5>International Applicants</h5><p>International applicants may be admitted on the basis of qualifications from their home countries for which equivalence shall be determined by the National Accreditation Board of Ghana and submitted to the University. Evidence of proficiency in English Language will be required in the case of applicants from non-English speaking countries. International applicants are also requested to acquire Non-Citizen Ghana card as a prerequisite for offer of admission. International applicants who fail to provide evidence of having acquired this card will not have their applications processed.</p>",
      "tags": "requirements, entry requirements, admission requirements"
  },
  {
      "title": "does upsa admit foreign students",
      "category": "admission",
      "answer": "<h3>Yes</h3>",
      "tags": "foreign, foreign students, admission, students"
  },
  {
      "title": "purchase of upsa application or admission forms",
      "category": "admission",
      "answer": "<p>At the following sales points: Any Ecobank or Access Bank branch nation-wide</p>",
      "tags": "sales of forms, admission forms, purchase, sales points, admission sales, buy"
  },
  {
      "title": "admission enquires or information",
      "category": "admission",
      "answer": "Visit the school admission <a href='https://admissions.upsa.edu.gh/'>site</a>",
      "tags": "admission enquires, admission information, freshmen, students, post-admission, applicant admitted, application, admission list, student admitted"
  },
  {
      "title": "check admission or application status",
      "category": "admission",
      "answer": "<p>You will receive a message by text or email based on the  contact information provided when filling the form.</p>",
      "tags": "application, status, pending admission, admission status"
  },
  {
      "title": "what is the cost of application or admission forms",
      "answer": "<h3>Ghanaian Applicants</h3> <p>Online Serial Numbers (OSN) for upsa are available for purchase at the cost of GH¢200.00</p> <br> <h3>International students</h3> <p>Application forms cost USD120.00.</p>",
      "category": "admission",
      "tags": "cost of admission, cost of application, application forms, how much, admission fee, application fee, buy"
  },
  {
      "title": "what is the website address for the upsa admission portal",
      "category": "admission",
      "answer": "<p>Access the UPSA admission portal via <a href='https://upsasip.com/adm-area'>portal link</a></p>",
      "tags": "admission portal, website address, web address"
  }
]
